# DeleteDLComponent

## Description
Deletes the nth component of the Double Line Preferences, where n is equal to index.

```pascal
FUNCTION DeleteDLComponent(index : INTEGER) : BOOLEAN;
```

```python

def vs.DeleteDLComponent(index):
    return BOOLEAN
```

## Parameters
|Name|Type|Description|
|---|---|---|
|index|INTEGER|The index of the component to delete.|

## See Also
VS Functions:
InsertNewDLComponent

## Version
Availability: from VectorWorks12.5
## Category
* Document Settings